OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/FOage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

ageOfAir
{
    // Mandatory entries
    type            age;
    libs            (fieldFunctionObjects);

    // Optional entries
    phi             phi;
    rho             rho;
    schemesField    age;
    tolerance       1e-5;
    nCorr           5;
    diffusion       on;

    // Inherited entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         10000;
    executeControl  writeTime;
    executeInterval -1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
